---
kind: method
id: M:Autodesk.Revit.DB.ScheduleDefinition.RemoveSortGroupField(System.Int32)
source: html/6e47776f-9a70-f422-0f14-35fd72b81b36.htm
---
# Autodesk.Revit.DB.ScheduleDefinition.RemoveSortGroupField Method

Removes a sorting/grouping field.

## Syntax (C#)
```csharp
public void RemoveSortGroupField(
	int index
)
```

## Parameters
- **index** (`System.Int32`) - The index of the sorting/grouping field to remove.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - index is not a valid sorting/grouping field index.